Bookers [課題②]/app/controllers/books_controller.rb

  def create
      @book=Book.new(book_params)
      @books=Book.all
      if @book.save
---
SELECT "books".* FROM "books"
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "title"], ["body", "mk"], ["created_at", "2020-02-07 11:07:34.853021"], ["updated_at", "2020-02-07 11:07:34.853021"]]