Bookers [課題③]/app/controllers/books_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 37], ["LIMIT", 1]]
---
	def show
		@book_new = Book.new
		@user = User.find(current_user.id)
		@book = Book.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "books".* FROM "books"
---
	def index
		@user = User.find(current_user.id)
		# user = User.find(params[:id])
		@book_new = Book.new
		@books = Book.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "books".* FROM "books"
INSERT INTO "books" ("created_at", "updated_at", "user_id", "title", "body") VALUES (?, ?, ?, ?, ?)  [["created_at", "2020-02-15 11:33:55.950687"], ["updated_at", "2020-02-15 11:33:55.950687"], ["user_id", 5], ["title", "nwnw"], ["body", "nwnwnw"]]
---
	def create
			@user = User.find(current_user.id)
			@book_new = Book.new(book_params)
			@books = Book.all
			@book_new.user_id = current_user.id
			if @book_new.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 36], ["LIMIT", 1]]
---
	def edit
		# @user = User.find(current_user)
		@book = Book.find(params[:id])